projects/03_OpenFOAM_Schaefer_Turek_2D2_Benchmark/case/runs/run_001_initial_coarse/0/U
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            codedFixedValue;
        value           uniform (0 0 0);
        name            parabolicInlet;

        code
        #{
            const scalar H = 0.41;
            const scalar Um = 1.5;

            const fvPatch& boundaryPatch = patch();
            vectorField& field = *this;

            forAll(field, i)
            {
                const scalar y = boundaryPatch.Cf()[i].y();
                const scalar ux = 4.0*Um*y*(H - y)/(H*H);
                field[i] = vector(ux, 0, 0);
            }
        #};
    }

    outlet
    {
        type            zeroGradient;
    }

    walls
    {
        type            noSlip;
    }

    cylinder
    {
        type            noSlip;
    }

    frontAndBack
    {
        type            zeroGradient;
    }
}
