projects/03_OpenFOAM_Schaefer_Turek_2D2_Benchmark/case/runs/run_001_initial_coarse/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          41;
        startFace       21855;
    }
    outlet
    {
        type            patch;
        nFaces          41;
        startFace       21896;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          440;
        startFace       21937;
    }
    frontAndBack
    {
        type            patch;
        
        nFaces          18752;
        startFace       22377;
    }
    cylinder
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          464;
        startFace       41129;
    }
)

// ************************************************************************* //
