projects/03_OpenFOAM_Schaefer_Turek_2D2_Benchmark/case/runs/run_001_initial_coarse/system/controlDict
FoamFile
{
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     icoFoam;

startFrom       startTime;
startTime       0;

stopAt          endTime;
endTime         8;

deltaT          0.001;

writeControl    timeStep;
writeInterval   500;

purgeWrite      0;

writeFormat     ascii;
writePrecision  8;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable true;

functions
{
    forces
    {
        type            forces;
        libs            ("libforces.so");

        patches         (cylinder);

        rho             rhoInf;
        rhoInf          1;

        CofR            (0.2 0.2 0);

        writeControl    timeStep;
        writeInterval   10;
    }

    forceCoeffs
    {
        type            forceCoeffs;
        libs            ("libforces.so");

        patches         (cylinder);

        rho             rhoInf;
        rhoInf          1;

        liftDir         (0 1 0);
        dragDir         (1 0 0);
        CofR            (0.2 0.2 0);
        pitchAxis       (0 0 1);

        magUInf         1.0;
        lRef            0.1;
        Aref            0.001;

        writeControl    timeStep;
        writeInterval   10;
    }
}
